// export enum Months {
//    MONTH = 'месяц',
//    JANUARY = 'января',
//    FEBRUARY = 'февраля',
//    MARCH = 'марта',
//    APRIL = 'апреля',
//    MAY = 'мая',
//    JUNY = 'июня',
//    JULY = 'июля',
//    AUGUST = 'августа',
//    SEPTEMBER = 'сентября',
//    OKTOBER = 'октября',
//    NOVEMBER = 'ноября',
//    DECEMBER = 'декабря',
// }

export type Months =
   | 'января'
   | 'февраля'
   | 'марта'
   | 'апреля'
   | 'мая'
   | 'июня'
   | 'июля'
   | 'августа'
   | 'сентября'
   | 'октября'
   | 'ноября'
   | 'декабря';
